OpenFoam/validation7rod/CHT/0/ciltop/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/heater";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    "axis.*"                { type empty; }
    "symmetry.*"            { type symmetry; }
    "cilbot.*"              { type fixedValue; value uniform 101325;}
    "ciltop.*"              { type fixedValue; value uniform 101325;}
    ".*_to_fluid"           { type fixedValue; value uniform 101325;}                  
}

// ************************************************************************* //
