OpenFoam/validation7rod/CHT/0/fluid/IDefault

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "Inlet|Outlet|Outterwall"
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 0.1;
        value           uniform 0;
    }

    "fluid_to_.*"
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 0.96;
        value           uniform 0;
    }

    "symmetry.*"   { type symmetry; }
}