OpenFoam/validation7rod/CHT/constant/cilcen/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  none;

absorptionEmissionModel constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
    absorptivity    absorptivity  [ 0 -1  0 0 0 0 0]  0;  //opaque
    emissivity      emissivity    [ 0 -1  0 0 0 0 0]  0;
    E               E             [ 1 -1 -3 0 0 0 0]  0;
}

scatterModel    none;

sootModel none;

// ************************************************************************* //
