OpenFoam/validation7rod/CHT/constant/ciltop/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/ciltop/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    ciltoptop
    {
        type            patch;
        nFaces          180;
        startFace       49720;
    }
    cilbottop
    {
        type            patch;
        nFaces          180;
        startFace       49900;
    }
    symmetrytop1
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1000;
        startFace       50080;
    }
    ciltop_to_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          3600;
        startFace       51080;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_ciltop;
    }
)

// ************************************************************************* //
