OpenFoam/validation7rod/CHT/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
convertToMeters 0.001;

vertices
(
    (6 0 0) //0
    (8.125 0 0) //1
    (8.125 4.690970937165709 0) //2
    (5.196152422706632 2.9999999999999996 0) //3
    (6 0 1000) //4
    (8.125 0 1000) //5
    (8.125 4.690970937165709 1000) //6
    (5.196152422706632 2.9999999999999996 1000) //7
    (22.25 0 0) //8
    (24.375 0 0) //9
    (24.375 4.690970937165709 0) //10
    (21.446152422706632 2.9999999999999996 0) //11
    (22.25 0 1000) //12
    (24.375 0 1000) //13
    (24.375 4.690970937165709 1000) //14
    (21.446152422706632 2.9999999999999996 1000) //15
    (16.25 9.381941874331417 0) //16
    (16.25 6 0) //17
    (16.25 9.381941874331417 1000) //18
    (16.25 6 1000) //19
    (11.053847577293368 2.9999999999999996 0) //20
    (11.053847577293368 2.9999999999999996 1000) //21
    (10.25 0 0) //22
    (10.25 0 1000) //23
    (26.843198238411656 4.690970937165709 0) //24
    (27.25 0 0) //25
    (26.843198238411656 4.690970937165709 1000) //26
    (27.25 0 1000) //27
    (23.599192253125956 13.624999999999998 0) //28
    (23.599192253125956 13.624999999999998 1000) //29
    (16.25 0 0) //30
    (16.25 0 1000) //31
    (0 0 0) //32
    (0 0 1000) //33
);

blocks
(
  hex ( 0 1 2 3 4 5 6 7 ) (27 6 100) simpleGrading (12 1 1)
  hex ( 8 9 10 11 12 13 14 15 ) (27 6 100) simpleGrading (12 1 1)
  hex ( 11 10 16 17 15 14 18 19 ) (27 12 100) simpleGrading (12 1 1)
  hex ( 17 16 2 20 19 18 6 21 ) (27 12 100) simpleGrading (12 1 1)
  hex ( 20 2 1 22 21 6 5 23 ) (27 6 100) simpleGrading (12 1 1)
  hex ( 24 10 9 25 26 14 13 27 ) (27 6 100) simpleGrading (12 1 1)
  hex ( 28 16 10 24 29 18 14 26 ) (27 12 100) simpleGrading (12 1 1)
  hex ( 30 11 17 30 31 15 19 31 ) (5 12 100) simpleGrading (0.1 1 1)
  hex ( 30 17 20 30 31 19 21 31 ) (5 12 100) simpleGrading (0.1 1 1)
  hex ( 30 20 22 30 31 21 23 31 ) (5 6 100) simpleGrading (0.1 1 1)
  hex ( 30 8 11 30 31 12 15 31 ) (5 6 100) simpleGrading (0.1 1 1)
  hex ( 32 0 3 32 33 4 7 33 ) (5 6 100) simpleGrading (0.1 1 1)
);

edges
(
    arc 4 7 (5.795554957734409 1.552914270615124 1000)
    arc 27 26 (27.148109068558693 2.3542884278781933 1000)
    arc 26 29 (25.61372500143396 9.300515660484482 1000)
    arc 12 15 (22.04555495773441 1.552914270615124 1000)
    arc 15 19 (19.25 5.196152422706632 1000)
    arc 19 21 (13.25 5.196152422706632 1000)
    arc 21 23 (10.45444504226559 1.552914270615124 1000)
    arc 0 3 (5.795554957734409 1.552914270615124 0)
    arc 25 24 (27.148109068558693 2.3542884278781933 0)
    arc 24 28 (25.61372500143396 9.300515660484482 0)
    arc 8 11 (22.04555495773441 1.552914270615124 0)
    arc 11 17 (19.25 5.196152422706632 0)
    arc 17 20 (13.25 5.196152422706632 0)
    arc 20 22 (10.45444504226559 1.552914270615124 0)
);

boundary
(
    Outterwall { type patch; faces ((29 26 24 28)(26 27 25 24));}
    ciltoptop { type patch; faces ((31 12 15 31)(31 15 19 31)(31 19 21 31)(31 21 23 31));}
    cilbottop { type patch; faces ((30 11 8 30)(30 17 11 30)(30 20 17 30)(30 22 20 30));}
    ciltopcen { type patch; faces ((33 4 7 33));}
    cilbotcen { type patch; faces ((32 3 0 32));}
    symmetryleft { type symmetry; faces ((5 4 0 1)(23 5 1 22)(13 12 8 9)(27 13 9 25));}
    symmetryrigt { type symmetry; faces ((7 6 2 3)(6 18 16 2)(18 29 28 16));}
    symmetrytop1 { type symmetry; faces ((12 31 30 8)(31 23 22 30));}
    symmetrycen1 { type symmetry; faces ((4 33 32 0));}
    symmetrycen2 { type symmetry; faces ((33 7 3 32));}
    Outlet { type patch; faces ((4 5 6 7)(23 21 6 5)(21 19 18 6)(19 15 14 18)(15 12 13 14)(14 26 29 18)(27 26 14 13));}
    Inlet { type patch; faces ((3 2 1 0)(1 2 20 22)(2 16 17 20)(16 10 11 17)(10 9 8 11)(10 16 28 24)(9 10 24 25));}
);

mergePatchPairs
(
);
