OpenFoam/validation7rod/CHT/system/cilcen/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sourcecen
{
    type            scalarSemiImplicitSource;
    active          true;
    selectionMode   cellSet;
    cellSet         cilcen;

    scalarSemiImplicitSourceCoeffs
    {
        // - absolute: values are given as <quantity>
        // - specific: values are given as <quantity>/m3
        volumeMode specific; 
        selectionMode cellZone;
        cellZone    cilcen;
        // Semi-implicit source term S(x) = S_u + S_p x
        // q'' = 264 W/m^2   ==> q''' =  165000 W/m^3
        // q'' = 807 W/m^2   ==> q''' =  509375 W/m^3
        // q'' = 2031 W/m^2  ==> q''' = 1281959 W/m^3
        // q'' = 3636 W/m^2  ==> q''' = 2295028 W/m^3
        injectionRateSuSp
        {
           h (80000 0);  
        }
    }
}


// ************************************************************************* //
