OpenFoam/validation7rod/CHT/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;

        smoother         DICGaussSeidel;

        cacheAgglomeration    true;
        nCellsInCoarsestLevel 10;
        agglomerator          faceAreaPair;
        mergeLevels           1;
    }

    "(U|h)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.01;
    }

    Ii
    {
        solver              GAMG;
        tolerance           1e-4;
        relTol              0;
        smoother            symGaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel   10;
        agglomerator        faceAreaPair;
        mergeLevels         1;
        maxIter             5;
        nPreSweeps          0;
        nPostSweeps         1;
    }
    
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        p_rgh           1e-6;
        Uz              1e-6;
        h               1e-6;
    }
}

relaxationFactors
{
    p_rgh           1.0;
    U               0.3;
    h               0.7;   
}

// ************************************************************************* //
